-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Sep 06, 2026 at 03:30 PM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `camera_shop`
--

-- --------------------------------------------------------

--
-- Table structure for table `banners`
--

CREATE TABLE `banners` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `link` varchar(255) DEFAULT '#',
  `status` tinyint(4) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `banners`
--

INSERT INTO `banners` (`id`, `title`, `image`, `link`, `status`) VALUES
(1, 'انواع دوربین های عکاسی و فیلم برداری', '1.jpg', '#', 1),
(5, 'انواع دوربین های عکاسی و فیلم برداری 2', 'banner_6a9d632a85ae02.99194246.jpg', '#', 1);

-- --------------------------------------------------------

--
-- Table structure for table `blog_comments`
--

CREATE TABLE `blog_comments` (
  `id` int(10) UNSIGNED NOT NULL,
  `blog_post_id` int(10) UNSIGNED NOT NULL,
  `name` varchar(100) NOT NULL,
  `email` varchar(150) NOT NULL,
  `comment` text NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `blog_comments`
--

INSERT INTO `blog_comments` (`id`, `blog_post_id`, `name`, `email`, `comment`, `status`, `created_at`, `updated_at`) VALUES
(1, 1, 'ilya', 'zareisara456@gmail.com', 'خوبه', 1, '2026-09-05 00:59:15', '2026-09-05 01:06:54');

-- --------------------------------------------------------

--
-- Table structure for table `blog_posts`
--

CREATE TABLE `blog_posts` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `slug` varchar(255) NOT NULL,
  `description` text DEFAULT NULL,
  `content` longtext DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `video_url` varchar(500) DEFAULT NULL,
  `author_name` varchar(255) DEFAULT NULL,
  `views` int(11) DEFAULT 0,
  `sort_order` int(11) DEFAULT 0,
  `status` tinyint(1) DEFAULT 1,
  `published_at` datetime DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `blog_posts`
--

INSERT INTO `blog_posts` (`id`, `title`, `slug`, `description`, `content`, `image`, `video_url`, `author_name`, `views`, `sort_order`, `status`, `published_at`, `created_at`, `updated_at`) VALUES
(1, 'چگونه تصویر را فلو کنیم؟', 'article-1788563566', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'blog_20260905011246_30979e056d.jpg', '', '', 25, 3, 1, '2026-09-05 01:12:00', '2026-09-05 02:42:46', '2026-09-05 16:38:49'),
(2, 'چگونه تصویر را فلو کنیم؟', 'article-1788563665', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'blog_20260905011425_3b0292445c.jpg', '', '', 16, 2, 1, '2026-09-05 01:14:25', '2026-09-05 02:44:25', '2026-09-06 10:41:16'),
(3, 'چگونه تصویر را فلو کنیم؟', 'article-1788564493', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'blog_20260905012813_53c87d7851.jpg', '', '', 9, 1, 1, '2026-09-05 01:28:00', '2026-09-05 02:58:13', '2026-09-06 10:41:22'),
(5, 'چگونه تصویر را فلو کنیم؟', 'article-1788564894', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'blog_20260905013454_6fff70baae.jpg', '', '', 0, 5, 1, '2026-09-05 01:34:00', '2026-09-05 03:04:54', '2026-09-05 03:06:54'),
(6, 'چگونه تصویر را فلو کنیم؟', 'article-1788565004', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'blog_20260905013644_d2cc448cec.jpg', '', '', 8, 4, 1, '2026-09-05 01:36:44', '2026-09-05 03:06:44', '2026-09-05 03:56:15'),
(7, 'چگونه تصویر را فلو کنیم؟', 'article-1788565146', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'blog_20260905013906_3feee99ff5.jpg', '', '', 0, 6, 1, '2026-09-05 01:39:06', '2026-09-05 03:09:06', '2026-09-05 03:09:06'),
(17, 'تکنیک های عکاسی زمستانی', 'article-1788618463', 'زمستان در حال آمدن است و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. \r\n\r\nنیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.', 'پیش از این که حتی تجهیزات خود را برای کار آماده کنید، از روز و یا روزهای قبل حتما وضعیت آب و هوای مکان مورد نظر خود را بررسی کنید. چرا که شما تا یک حد آب و هوای نامساعد را می‌توانید تحمل کنید و اگر در طبیعت مورد نظر گرفتار باد و طوفان و یا بارشهای شدید شوید، هم خودتان و هم تجهیزات گرانقیمتتان آسیب خواهد دید. \r\n\r\nاستفاده از دوربین عکاسی در آب و هوای سرد به هیچ‌وجه آسان نیست. بسیاری از دوربین‌ها حتی دچار اشکالات فنی در دمای بسیار سرد می‌شوند. از نظر کنترل کردن و اجرای تنظیمات مورد نظر هم با وجود دستکشهایی که پوشیده‌اید بسیار سخت و حتی غیرممکن است. برای حل این مشکل بسیار پیشنهاد می‌کنند که دستکشهای انگشت را امتحان کنید که اگر در بالای کوه هستید و یا در منطقهی سرد سیر که مثلا دمای منفی بیست درجه دارد، عملا انگشتتان یخ میزنند و به نوعی این دستکشها جوابگو نیستند. اما استفاده از دستکشهای ضخیم و گلفت هم کار کردن با دوربین را سخت می‌کند.', 'blog_20260905162743_7bddf504f2.png', '', '', 20, 0, 1, '2026-09-05 16:27:00', '2026-09-05 17:57:43', '2026-09-06 10:50:06');

-- --------------------------------------------------------

--
-- Table structure for table `blog_post_blocks`
--

CREATE TABLE `blog_post_blocks` (
  `id` int(10) UNSIGNED NOT NULL,
  `post_id` int(10) UNSIGNED NOT NULL,
  `type` enum('heading','text','image','video') NOT NULL,
  `content` text DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `video_url` varchar(500) DEFAULT NULL,
  `sort_order` int(11) NOT NULL DEFAULT 0,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `blog_post_blocks`
--

INSERT INTO `blog_post_blocks` (`id`, `post_id`, `type`, `content`, `image`, `video_url`, `sort_order`, `created_at`, `updated_at`) VALUES
(1, 9, 'image', 'ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.', 'blog_block_20260905152744_7d5c61be56.png', '', 0, '2026-09-05 13:27:44', '2026-09-05 13:27:44'),
(2, 10, 'text', 'ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.', '', '', 0, '2026-09-05 13:30:12', '2026-09-05 13:30:12'),
(3, 10, 'text', 'ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.', '', '', 1, '2026-09-05 13:30:12', '2026-09-05 13:30:12'),
(4, 11, 'text', 'تکنیک های عکاسی زمستانی\r\n\r\n\r\nستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.', '', '', 0, '2026-09-05 13:32:54', '2026-09-05 13:32:54'),
(5, 12, 'text', 'ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.', '', '', 0, '2026-09-05 13:39:28', '2026-09-05 13:39:28'),
(6, 12, 'text', 'ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.ستان در حال آماده‌نست و بارش برف در بسیاری از مناطق کشور سبب ایجاد صحنه‌های زیبا و استثنایی برای عکاسی می‌شود که هیچ عکاسی دوست ندارد آنها را از دست بدهد. همین صحنه‌های منحصربه‌فرد طبیعی هستند که عکاسی زمستانی را به یک شاخه‌های پرطرفدار عکاسی بدل کرده است، خصوصاً که بارش برف در بسیاری از مکان‌ها به ندرت رخ می‌دهد و این مناظر دائمی نیستند. تصاویری که گرفته شده از مناظر زمستانی حسی کاملاً متفاوت را به بیننده القا می‌کنند و البته این سبک هم با چالش‌های خودش همراه است. نیازی به گفتن این نکته نیست که با وجود بارش برف و یخ زدن جاده‌ها و غیره، چندین نکته ایمنی هست که به هر عکاسی باید رعایت کند تا هم از خودش به سلامت جسمی و از تجهیزاتی که همراه دارد مراقبت کند.', '', '', 1, '2026-09-05 13:39:28', '2026-09-05 13:39:28'),
(7, 13, 'image', 'تکنیک های عکاسی زمستانی', 'blog_block_20260905154306_ae121e13f7.png', '', 0, '2026-09-05 13:43:06', '2026-09-05 13:43:06'),
(8, 13, 'image', 'تکنیک های عکاسی زمستانی', 'blog_block_20260905154306_b6772e2602.png', '', 1, '2026-09-05 13:43:06', '2026-09-05 13:43:06'),
(80, 16, 'heading', 'تکنیک های عکاسی زمستانی', '', '', 0, '2026-09-05 14:23:20', '2026-09-05 14:23:20'),
(81, 16, 'text', 'پیش از این که حتی تجهیزات خود را برای کار آماده کنید، از روز و یا روزهای قبل حتما وضعیت آب و هوای مکان مورد نظر خود را بررسی کنید. چرا که شما تا یک حد آب و هوای نامساعد را می‌توانید تحمل کنید و اگر در طبیعت مورد نظر گرفتار باد و طوفان و یا بارشهای شدید شوید، هم خودتان و هم تجهیزات گرانقیمتتان آسیب خواهد دید. استفاده از دوربین عکاسی در آب و هوای سرد به هیچ‌وجه آسان نیست. بسیاری از دوربین‌ها حتی دچار اشکالات فنی در دمای بسیار سرد می‌شوند. از نظر کنترل کردن و اجرای تنظیمات مورد نظر هم با وجود دستکشهایی که پوشیده‌اید بسیار سخت و حتی غیرممکن است. برای حل این مشکل بسیار پیشنهاد می‌کنند که دستکشهای انگشت را امتحان کنید که اگر در بالای کوه هستید و یا در منطقهی سرد سیر که مثلا دمای منفی بیست درجه دارد، عملا انگشتتان یخ میزنند و به نوعی این دستکشها جوابگو نیستند. اما استفاده از دستکشهای ضخیم و گلفت هم کار کردن با دوربین را سخت می‌کند.', '', '', 1, '2026-09-05 14:23:20', '2026-09-05 14:23:20'),
(82, 16, 'image', '', 'blog_20260905162320_36805a3fd8.png', '', 2, '2026-09-05 14:23:20', '2026-09-05 14:23:20'),
(83, 16, 'heading', 'تکنیک های عکاسی زمستانی', '', '', 3, '2026-09-05 14:23:20', '2026-09-05 14:23:20'),
(84, 16, 'text', 'بهترین کار برای برطرف کردن این قضیه تمرین کردن با این دستکش‌هاست. همیشه یک ستایه خوب همراه خود داشته باشید و سعی کنید از ریموت کنترل استفاده کنید. برای گرم شدن خود هم تجهیزات مناسب فراهم کنید. نکته مهمی که باید به آن توجه کنید این است که به صورت دوربین را از محیط با دمای سرد به محیط گرم نبرید. این کار سبب مه گرفتن دوربینتان می‌شود، یعنی بخار درون سیستم آن پدید می‌آید و نمی‌توانید با کیفیت بهتر عکاسی کنید. از طرفی پس از بیرون بردن دوربین و یخ زدن آن، بخار مشکلات فنی عدیده‌ای برای دوربینتان پیش خواهد آمد. به منظور مواجه نشدن با این مشکل، قبل از ورود به مکان گرم، دوربینتان را در کیف بگذارید و اگر محیط خیلی سرد است، حتما آن را در کیسهی پلاستیکی بگذارید. این کار سبب می‌شود تا یواش یواش گرم شود.', '', '', 4, '2026-09-05 14:23:20', '2026-09-05 14:23:20'),
(85, 16, 'image', '', 'blog_20260905161844_925401a41c.png', '', 5, '2026-09-05 14:23:20', '2026-09-05 14:23:20'),
(86, 16, 'heading', '', '', '', 6, '2026-09-05 14:23:20', '2026-09-05 14:23:20'),
(87, 16, 'text', 'بهترین کار برای برطرف کردن این قضیه تمرین کردن با این دستکش‌هاست. همیشه یک ستایه خوب همراه خود داشته باشید و سعی کنید از ریموت کنترل استفاده کنید. برای گرم شدن خود هم تجهیزات مناسب فراهم کنید. نکته مهمی که باید به آن توجه کنید این است که به صورت دوربین را از محیط با دمای سرد به محیط گرم نبرید. این کار سبب مه گرفتن دوربینتان می‌شود، یعنی بخار درون سیستم آن پدید می‌آید و نمی‌توانید با کیفیت بهتر عکاسی کنید. از طرفی پس از بیرون بردن دوربین و یخ زدن آن، بخار مشکلات فنی عدیده‌ای برای دوربینتان پیش خواهد آمد. به منظور مواجه نشدن با این مشکل، قبل از ورود به مکان گرم، دوربینتان را در کیف بگذارید و اگر محیط خیلی سرد است، حتما آن را در کیسهی پلاستیکی بگذارید. این کار سبب می‌شود تا یواش یواش گرم شود.', '', '', 7, '2026-09-05 14:23:20', '2026-09-05 14:23:20'),
(88, 16, 'video', '', '', '', 8, '2026-09-05 14:23:20', '2026-09-05 14:23:20'),
(106, 17, 'heading', 'تکنیک های عکاسی زمستانی', '', '', 0, '2026-09-05 14:45:47', '2026-09-05 14:45:47'),
(107, 17, 'text', 'پیش از این که حتی تجهیزات خود را برای کار آماده کنید، از روز و یا روزهای قبل حتما وضعیت آب و هوای مکان مورد نظر خود را بررسی کنید. چرا که شما تا یک حد آب و هوای نامساعد را می‌توانید تحمل کنید و اگر در طبیعت مورد نظر گرفتار باد و طوفان و یا بارشهای شدید شوید، هم خودتان و هم تجهیزات گرانقیمتتان آسیب خواهد دید. \r\n\r\nاستفاده از دوربین عکاسی در آب و هوای سرد به هیچ‌وجه آسان نیست. بسیاری از دوربین‌ها حتی دچار اشکالات فنی در دمای بسیار سرد می‌شوند. از نظر کنترل کردن و اجرای تنظیمات مورد نظر هم با وجود دستکشهایی که پوشیده‌اید بسیار سخت و حتی غیرممکن است. برای حل این مشکل بسیار پیشنهاد می‌کنند که دستکشهای انگشت را امتحان کنید که اگر در بالای کوه هستید و یا در منطقهی سرد سیر که مثلا دمای منفی بیست درجه دارد، عملا انگشتتان یخ میزنند و به نوعی این دستکشها جوابگو نیستند. اما استفاده از دستکشهای ضخیم و گلفت هم کار کردن با دوربین را سخت می‌کند.', '', '', 1, '2026-09-05 14:45:47', '2026-09-05 14:45:47'),
(108, 17, 'image', '', 'blog_20260905162743_7bddf504f2.png', '', 2, '2026-09-05 14:45:47', '2026-09-05 14:45:47'),
(109, 17, 'heading', '', '', '', 3, '2026-09-05 14:45:47', '2026-09-05 14:45:47'),
(110, 17, 'text', 'بهترین کار برای برطرف کردن این قضیه تمرین کردن با این دستکش‌هاست. همیشه یک ستایه خوب همراه خود داشته باشید و سعی کنید از ریموت کنترل استفاده کنید. برای گرم شدن خود هم تجهیزات مناسب فراهم کنید.\r\n\r\n نکته مهمی که باید به آن توجه کنید این است که به صورت دوربین را از محیط با دمای سرد به محیط گرم نبرید. این کار سبب مه گرفتن دوربینتان می‌شود، یعنی بخار درون سیستم آن پدید می‌آید و نمی‌توانید با کیفیت بهتر عکاسی کنید. از طرفی پس از بیرون بردن دوربین و یخ زدن آن، بخار مشکلات فنی عدیده‌ای برای دوربینتان پیش خواهد آمد. به منظور مواجه نشدن با این مشکل، قبل از ورود به مکان گرم، دوربینتان را در کیف بگذارید و اگر محیط خیلی سرد است، حتما آن را در کیسهی پلاستیکی بگذارید. این کار سبب می‌شود تا یواش یواش گرم شود.', '', '', 4, '2026-09-05 14:45:47', '2026-09-05 14:45:47'),
(111, 17, 'image', '', 'blog_20260905162743_5d7d20c76c.png', '', 5, '2026-09-05 14:45:47', '2026-09-05 14:45:47'),
(112, 17, 'heading', 'تجهیزات مناسب در زمستان', '', '', 6, '2026-09-05 14:45:47', '2026-09-05 14:45:47'),
(113, 17, 'text', 'پس شما در ابتدا به ابزارهای نیاز دارید که خود و دوربین شما را گرم نگه دارند. از کیفهای پلاستیکی مخصوص برای لنز و دوربین استفاده کنید و از دستکشهای گرم مخصوص عکاسی که راحت بتوانید با آنها دوربین را در دست بگیرید و هر کاری با آن بکنید.', '', '', 7, '2026-09-05 14:45:47', '2026-09-05 14:45:47'),
(114, 17, 'video', '', '', '', 8, '2026-09-05 14:45:47', '2026-09-05 14:45:47');

-- --------------------------------------------------------

--
-- Table structure for table `brands`
--

CREATE TABLE `brands` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `logo` varchar(255) DEFAULT NULL,
  `link` varchar(255) DEFAULT '#',
  `sort_order` int(11) DEFAULT 0,
  `status` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `brands`
--

INSERT INTO `brands` (`id`, `name`, `logo`, `link`, `sort_order`, `status`) VALUES
(1, 'فوجی‌فیلم', 'brand_6a98837ba11a19.69521501.webp', '#', 5, 1),
(2, 'panasonic', 'brand_6a9884e25db0d0.17112736.webp', '#', 4, 1),
(3, 'sony', 'brand_6a9885684ff450.46172961.webp', '#', 3, 1),
(4, 'canon', 'brand_6a9885baaf8728.82789568.webp', '#', 2, 1),
(5, 'Nikon', 'brand_6a988a96035c87.39251191.png', '#', 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `slug` varchar(255) NOT NULL,
  `image` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `status` tinyint(4) DEFAULT 1,
  `sort_order` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`id`, `name`, `slug`, `image`, `description`, `status`, `sort_order`) VALUES
(2, 'فیلم برداری', 'video', NULL, 'میتسدبدنیستتتتتتتتتتتتتتتتتتتید', 1, 2),
(3, 'لنز دوربین عکاسی', 'lens', NULL, NULL, 1, 3),
(4, 'دوربین های ورزشی', 'sport', NULL, NULL, 1, 4),
(5, 'نورپردازی', 'lighting', NULL, NULL, 1, 5),
(6, 'لوازم جانبی', 'accessories', NULL, NULL, 1, 6),
(13, 'دوربین عکاسی', 'camera', NULL, 'حتی اگر به تازگی به یک دوربین دیجیتالی عکاسی علاقه‌مند شده‌اید و چندی از عکاسی دیجیتالی گرفته باشید و چندین بار با آن کار کرده باشید، این مدل دوربین دیجیتالی کانن می‌تواند در حفظ خود در DSLR های مختلفه ای ام از بهترین گزینه‌ها باشد.\r\n\r\nبا تجربه‌ای که این برند معتبر در طول سال‌های فعالیت خود در دنیای دیجیتالی به دست آورده است، محصولاتی را تولید می‌کند که از فناوری منحصر به فردی استفاده می‌کنند و همواره کوشیده است با کیفیت بالای تولید، رضایت مشتریان را در بالاترین حد نگه دارد. در چند سال اخیر محصولات استفاده در دوربین‌های گوناگون بین عکاسان شناخته شده و حرفه‌ای این صنعت بسیار شناخته شده است و توانسته تا حد زیادی رضایت کاربران خود را جلب کند.\r\n\r\nانواع دوربین های کانن\r\n\r\nو اما اینکه هستند که بیشتر توسط حرفه‌ای‌ها استفاده دارند. این دوربین‌ها از نمونه‌های با کیفیت و همچنین سری‌های بدون آینه با امکانات و تکنولوژی‌های پیشرفته هستند. دوربین‌های DSLR شامل دیجیتال می‌شوند و سری کامپکت بیشتر برای افرادی مناسب است که هدف حرفه‌ای کار کردن در این زمینه را ندارند. همچنین به دلیل داشتن ویژگی‌های مناسب برای کسانی که بیشتر به مسافرت می‌روند مناسب هستند.\r\n\r\nقیمت دوربین عکاسی کانن\r\n\r\nقیمت دوربین عکاسی کانن بدون شک وابسته به نوع و کیفیت دوربین، کارایی آن دارد و هرچه این تکنولوژی پیشرفته‌تر باشد قیمت محصول بیشتر می‌شود. در شرایطی که امروزه در بازار ایران به وجود آمده قیمت محصولات کانن بسیار مناسب بوده و محصولات با کیفیتی عرضه می‌شوند.\r\n\r\nهمچنین قیمت‌های این برند با توجه به نوع آن‌ها نیز دسته‌بندی می‌شود که در این نوع دسته‌بندی سری مدل‌های کامپکت قیمت به مراتب ارزان‌تر است. مدل‌های بدون آینه هم معمولا از سایر مدل‌ها که سنسور بزرگ‌تر و قابلیت‌های حرفه‌ای آن بیشتر را ارائه می‌دهند، DSLR هم در رده متوسط قرار می‌گیرد و قیمت دوربین متفاوت خواهد بود.\r\n\r\nخرید دوربین عکاسی کانن\r\n\r\nدر دیجی 24 آرشیو کامل از دوربین‌های عکاسی کانن را برای جامعه عکاسان ایران تهیه کرده است و مشتریان محترم می‌توانند برای خرید دوربین کانن با مجموعه ما در ارتباط تلفنی 24 ساعته و یا با مراجعه حضوری، محصول مورد نظر خود را انتخاب و خرید کنند.\r\n\r\nدر ضمن برای افرادی که در زمینه عکاسی تجربه‌ای ندارند و تازه می‌خواهند در این مسیر قدم بردارند امکان دریافت مشاوره رایگان را فراهم کرده ایم تا با اطمینان بیشتری خرید خود را انجام دهند و بهتر به حرفه خود بپردازند.', 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `category_faq`
--

CREATE TABLE `category_faq` (
  `id` int(11) NOT NULL,
  `category_id` int(11) NOT NULL,
  `question` varchar(255) NOT NULL,
  `answer` text NOT NULL,
  `sort_order` int(11) DEFAULT 0,
  `status` tinyint(4) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `category_faq`
--

INSERT INTO `category_faq` (`id`, `category_id`, `question`, `answer`, `sort_order`, `status`) VALUES
(1, 13, 'نحوه خرید و سفارش دوربین کانن در دیجی24 چگونه است؟؟', '.', 1, 1),
(2, 13, 'نحوه پرداخت هزینه دوربین های کنون در دیجی24 چگونه است؟', '.', 2, 1),
(3, 13, 'ایا دوربین های کانن با گارانتی عرضه میشوند؟', '.', 3, 1),
(4, 13, 'ایا امکان مراجعه و خرید دوربین های کانن به صورت حضوری هم وجود دارد؟', 'بله. به راحتی می‌توانید با مراجعه به آدرس مشخص شده در صفحه تماس با ما، هر محصولی که خواستید را به صورت حضوری خریداری کنید.', 4, 1);

-- --------------------------------------------------------

--
-- Table structure for table `contact_info`
--

CREATE TABLE `contact_info` (
  `id` int(11) NOT NULL,
  `type` varchar(50) NOT NULL,
  `title` varchar(255) DEFAULT NULL,
  `content` text DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `sort_order` int(11) NOT NULL DEFAULT 0,
  `status` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `contact_info`
--

INSERT INTO `contact_info` (`id`, `type`, `title`, `content`, `image`, `sort_order`, `status`, `created_at`, `updated_at`) VALUES
(1, 'address', '', 'تهران،خ شیخ هادی، خ هاتف، کوچه کسری، پلاک 30', '', 1, 1, '2026-09-05 20:11:43', '2026-09-05 20:47:54'),
(2, 'working_hours', '', 'شنبه الی چهارشنبه 9:00 الی 21:00 \r\n\r\n پنجشنبه 9:00 الی 18:00\r\n\r\n جمعه تعطیل', '', 1, 1, '2026-09-05 20:45:59', '2026-09-05 20:46:15'),
(3, 'address', '', 'تهران،ناصر خسرو،پاساژ ناصر خسرو،پلاک 385،طبقه همکف واحد 21', '', 2, 1, '2026-09-05 20:49:21', '2026-09-05 20:49:21'),
(4, 'phone', '', '66705948021', '', 1, 1, '2026-09-05 20:49:54', '2026-09-05 20:49:54'),
(5, 'phone', '', '0912806602', '', 2, 1, '2026-09-05 20:50:13', '2026-09-05 20:50:13'),
(6, 'working_hours', 'شنبه تا چهارشنبه', '9 صبح تا 18 عصر', 'contact_1788641756_5392.jpg', 1, 1, '2026-09-05 20:54:06', '2026-09-05 20:55:56');

-- --------------------------------------------------------

--
-- Table structure for table `contact_messages`
--

CREATE TABLE `contact_messages` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `email` varchar(150) NOT NULL,
  `message` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `is_read` tinyint(1) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `contact_messages`
--

INSERT INTO `contact_messages` (`id`, `name`, `email`, `message`, `created_at`, `is_read`) VALUES
(1, 'sara', 'zareisara456@gmail.com', 'ممنونم', '2026-08-19 21:29:50', 1),
(2, 'raya', 'zareisara456@gmail.com', 'اوکی', '2026-08-19 21:32:32', 1),
(3, 'moh', 'zareisara456@gmail.com', 'موضوع: ساعت کاری\n\nساعت کاریتون چجوریه', '2026-09-05 22:45:33', 1),
(4, 'moh', 'zareisara456@gmail.com', 'موضوع: ساعت کاری\n\nساعت کاریتون چجوریه', '2026-09-05 22:59:38', 1),
(5, 'moh', 'zareisara456@gmail.com', 'موضوع: ساعت کاری\n\nساعت کاریتون چجوریه', '2026-09-05 23:01:49', 1),
(6, 'دوربین فوجی فیلم GFX100S', 'zareisara456@gmail.com', 'موضوع: ساعت کاری\n\nسلاک', '2026-09-05 23:03:28', 1),
(7, 'دوربین فوجی فیلم GFX100S', 'zareisara456@gmail.com', 'موضوع: ساعت کاری\n\nسلاک', '2026-09-05 23:04:02', 1),
(8, 'دوربین فوجی فیلم GFX100S', 'zareisara456@gmail.com', 'موضوع: ساعت کاری\n\nسلاک', '2026-09-05 23:08:51', 1);

-- --------------------------------------------------------

--
-- Table structure for table `contact_page`
--

CREATE TABLE `contact_page` (
  `id` int(11) NOT NULL,
  `title` varchar(255) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `hero_image` varchar(255) DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `contact_page`
--

INSERT INTO `contact_page` (`id`, `title`, `description`, `hero_image`, `status`, `created_at`, `updated_at`) VALUES
(1, 'درباره Digi245', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 'contact_hero_1788642794_5895.png', 1, '2026-09-05 21:00:31', '2026-09-05 21:13:14');

-- --------------------------------------------------------

--
-- Table structure for table `customer_comments`
--

CREATE TABLE `customer_comments` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `image` varchar(255) DEFAULT NULL,
  `comment` text NOT NULL,
  `rating` tinyint(1) DEFAULT 5,
  `sort_order` int(11) DEFAULT 0,
  `status` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `customer_comments`
--

INSERT INTO `customer_comments` (`id`, `name`, `image`, `comment`, `rating`, `sort_order`, `status`) VALUES
(3, 'sara', 'comment_6a987fe909afa2.43207792.jpg', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 3, 0, 1),
(4, 'ana', 'comment_6a98810427e095.45100135.jpg', 'طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید تا از نظر گرافیکی نشانگر چگونهگی نوع و اندازه فونت، فواصل متن طراحی گرافیک از این متن به عنوان عنصری از ترکیب‌بندی برای پرکردن صفحه و آرایش اولیه شکل ظاهری.', 5, 0, 1);

-- --------------------------------------------------------

--
-- Table structure for table `footer`
--

CREATE TABLE `footer` (
  `id` int(11) NOT NULL,
  `about_title` varchar(255) NOT NULL,
  `about_text` text DEFAULT NULL,
  `useful_links_title` varchar(255) NOT NULL,
  `latest_posts_title` varchar(255) NOT NULL DEFAULT 'آخرین مطالب',
  `support_title` varchar(255) NOT NULL,
  `email_receiver` varchar(255) DEFAULT NULL,
  `description_title` varchar(255) NOT NULL,
  `description_text` text DEFAULT NULL,
  `instagram` varchar(255) DEFAULT NULL,
  `twitter` varchar(255) DEFAULT NULL,
  `telegram` varchar(255) DEFAULT NULL,
  `copyright_text` text DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 1,
  `facebook_icon` varchar(255) DEFAULT NULL,
  `facebook_link` varchar(255) DEFAULT NULL,
  `twitter_icon` varchar(255) DEFAULT NULL,
  `twitter_link` varchar(255) DEFAULT NULL,
  `aparat_icon` varchar(255) DEFAULT NULL,
  `aparat_link` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `footer`
--

INSERT INTO `footer` (`id`, `about_title`, `about_text`, `useful_links_title`, `latest_posts_title`, `support_title`, `email_receiver`, `description_title`, `description_text`, `instagram`, `twitter`, `telegram`, `copyright_text`, `status`, `facebook_icon`, `facebook_link`, `twitter_icon`, `twitter_link`, `aparat_icon`, `aparat_link`) VALUES
(1, '', '', 'لینک های مرتبط', 'آخرین مطالب', 'ارتباط با ما', '', 'کوتاه از دیجی 24', 'فروشگاه دیجی ۲۴  عرضه‌کننده و پخش‌کننده انواع دوربین، لنز و تجهیزات جانبی عکاسی و فیلمبرداری است. این مجموعه با عرضه بهترین و رقابتی‌ترین قیمت‌های بازار، نماینده فروش برندهای معتبر این صنعت می‌باشد.', '#', '#', '#', 'طراحی و اجرا توسط آژانس خلاقیت کرگدن.', 1, '', '', '', '', '', '');

-- --------------------------------------------------------

--
-- Table structure for table `footer_emails`
--

CREATE TABLE `footer_emails` (
  `id` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `footer_emails`
--

INSERT INTO `footer_emails` (`id`, `email`, `created_at`) VALUES
(2, 'zareisara456@gmail.com', '2026-09-03 00:36:45');

-- --------------------------------------------------------

--
-- Table structure for table `footer_items`
--

CREATE TABLE `footer_items` (
  `id` int(11) NOT NULL,
  `type` varchar(50) NOT NULL,
  `title` varchar(255) NOT NULL,
  `content` text DEFAULT NULL,
  `link` varchar(500) DEFAULT NULL,
  `sort_order` int(11) NOT NULL DEFAULT 0,
  `status` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `footer_items`
--

INSERT INTO `footer_items` (`id`, `type`, `title`, `content`, `link`, `sort_order`, `status`) VALUES
(5, 'related_link', 'انواع دوربین عکاسی', 'معرفی انواع دوربین‌های عکاسی', '', 1, 1),
(6, 'related_link', 'انواع لنز', 'معرفی انواع لنزهای عکاسی', 'products.php?category=2', 2, 1),
(8, 'related_link', 'لوازم جانبی', '', 'products.php?category=3', 4, 1),
(9, 'related_link', 'لرزش گیر دوربین', '', 'products.php?category=4', 4, 1),
(10, 'latest_post', 'انواع دوبین عکاسی', '', 'products.php?category=1', 1, 1),
(11, 'latest_post', 'انواع لنز', '', 'products.php?category=2', 2, 1),
(12, 'latest_post', 'لوازم جانبی', '', 'products.php?category=3', 3, 1),
(13, 'latest_post', 'لرزشگیر دوربین', '', 'products.php?category=4', 4, 1),
(14, 'contact', 'ادرس ایمیل', '', '', 1, 1);

-- --------------------------------------------------------

--
-- Table structure for table `footer_socials`
--

CREATE TABLE `footer_socials` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `content` text DEFAULT NULL,
  `icon` varchar(255) DEFAULT NULL,
  `link` varchar(500) DEFAULT NULL,
  `sort_order` int(11) NOT NULL DEFAULT 0,
  `status` tinyint(1) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `footer_socials`
--

INSERT INTO `footer_socials` (`id`, `title`, `content`, `icon`, `link`, `sort_order`, `status`) VALUES
(1, 'facebok', '', 'social_1788396709_7530.png', '', 0, 1),
(2, 'x', '', 'social_1788397113_7681.png', '', 0, 1),
(3, 'aparat', '', 'social_1788397197_5355.png', '', 0, 1);

-- --------------------------------------------------------

--
-- Table structure for table `home_content`
--

CREATE TABLE `home_content` (
  `id` int(11) NOT NULL,
  `section` varchar(100) NOT NULL,
  `title` varchar(255) DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `link` varchar(255) DEFAULT NULL,
  `content` text NOT NULL,
  `sort_order` int(11) DEFAULT 0,
  `status` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `home_content`
--

INSERT INTO `home_content` (`id`, `section`, `title`, `image`, `link`, `content`, `sort_order`, `status`) VALUES
(1, 'banner', 'انواع دوربین های عکاسی و فیلم برداری', '', '#', '', 0, 1),
(2, 'flash', NULL, 'flash.png', NULL, '', 0, 1),
(3, 'short', 'کوتاه از Digi24', '', NULL, 'طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.', 0, 1),
(4, 'short_box', 'گارانتی محصول', '', NULL, 'طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.', 0, 1),
(5, 'short_box', 'پشتیبانی ۲۴ ساعته', '', NULL, 'طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.', 0, 1),
(6, 'short_box', 'ارسال سریع', '', NULL, 'طراح گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و آرایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می‌نماید.', 0, 1),
(9, 'gallery_title', 'گالری محصولات', NULL, NULL, '', 1, 1),
(10, 'latest_products_title', 'برخی از جدیدترین محصولات', NULL, NULL, '', 10, 1),
(11, 'camera_title', 'دوربین های عکاسی', NULL, NULL, '', 11, 1),
(12, 'lens_title', 'لنز دوربین', NULL, NULL, '', 12, 1),
(13, 'accessory_title', 'لوازم جانبی دوربین', NULL, NULL, '', 13, 1),
(14, 'photography_news', 'تازه های دنیای عکاسی و فیلمبرداری', '', '#', 'در این قسمت جدیدترین مطالب، اخبار و آموزش‌های مربوط به دنیای عکاسی و فیلمبرداری را مشاهده نمایید.', 0, 1);

-- --------------------------------------------------------

--
-- Table structure for table `latest_product_boxes`
--

CREATE TABLE `latest_product_boxes` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `category_id` int(11) DEFAULT NULL,
  `link` varchar(255) DEFAULT '#',
  `sort_order` int(11) DEFAULT 0,
  `status` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `latest_product_boxes`
--

INSERT INTO `latest_product_boxes` (`id`, `title`, `category_id`, `link`, `sort_order`, `status`) VALUES
(1, 'دوربین های عکاسی', 13, 'category.php?id=13', 1, 1),
(2, 'انواع لنز دوربین', 3, 'category.php?id=3', 2, 1),
(3, 'پایه دوربین', 6, 'category.php?id=6', 3, 1);

-- --------------------------------------------------------

--
-- Table structure for table `latest_product_box_items`
--

CREATE TABLE `latest_product_box_items` (
  `id` int(11) NOT NULL,
  `box_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `sort_order` int(11) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `menus`
--

CREATE TABLE `menus` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `link` varchar(255) NOT NULL,
  `sort_order` int(11) DEFAULT 0,
  `status` tinyint(4) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `menus`
--

INSERT INTO `menus` (`id`, `title`, `link`, `sort_order`, `status`) VALUES
(1, 'صفحه اصلی', 'index.php', 1, 1),
(2, 'دوربین عکاسی', 'shop.php?category=13', 1, 1),
(3, 'فیلم برداری', 'shop.php?category=2', 2, 1),
(4, 'لنز دوربین عکاسی', 'shop.php?category=3', 4, 1),
(5, 'دوربین های ورزشی', 'shop.php?category=4', 5, 1),
(6, 'نورپردازی', 'shop.php?category=5', 6, 1),
(7, 'لوازم جانبی', 'shop.php?category=6', 7, 1),
(8, 'وبلاگ', 'blog.php', 8, 1),
(9, 'تماس با ما', 'contact.php', 9, 1);

-- --------------------------------------------------------

--
-- Table structure for table `orders`
--

CREATE TABLE `orders` (
  `id` int(11) NOT NULL,
  `user_id` int(11) DEFAULT NULL,
  `customer_name` varchar(255) NOT NULL,
  `customer_phone` varchar(50) NOT NULL,
  `customer_email` varchar(255) DEFAULT NULL,
  `customer_address` text NOT NULL,
  `total_price` int(11) NOT NULL DEFAULT 0,
  `status` varchar(50) NOT NULL DEFAULT 'pending',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `orders`
--

INSERT INTO `orders` (`id`, `user_id`, `customer_name`, `customer_phone`, `customer_email`, `customer_address`, `total_price`, `status`, `created_at`) VALUES
(1, 1, 'ایلیا', '09352941643', 'zareisara456@gmail.com', 'ذاتتارنلزنبغزنغفز', 25000000, 'completed', '2026-08-20 09:46:31'),
(2, 1, 'Sara Zarei', '09122941633', 'zareisara456@gmail.com', 'تذننذاذ', 7000000, 'pending', '2026-08-25 13:11:12'),
(3, 1, 'Sara Zarei', '09352941643', 'zareisara456@gmail.com', 'ئئئئئئئئئئئئئئئئئ', 17600000, 'completed', '2026-08-25 13:17:10'),
(4, 1, 'Sara Zarei', '09122941633', 'zareisara456@gmail.com', 'ممممممممممممممم', 3500000, 'pending', '2026-08-25 13:27:25'),
(5, 3, 'ilya', '09352941643', 'zareisara456@gmail.com', 'oo', 64000000, 'pending', '2026-09-06 03:05:00');

-- --------------------------------------------------------

--
-- Table structure for table `order_items`
--

CREATE TABLE `order_items` (
  `id` int(11) NOT NULL,
  `order_id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `product_name` varchar(255) NOT NULL,
  `price` int(11) NOT NULL,
  `quantity` int(11) NOT NULL DEFAULT 1,
  `subtotal` int(11) NOT NULL DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_persian_ci;

--
-- Dumping data for table `order_items`
--

INSERT INTO `order_items` (`id`, `order_id`, `product_id`, `product_name`, `price`, `quantity`, `subtotal`) VALUES
(1, 1, 1, 'Canon EOS 2000Dباکیفی', 25000000, 1, 25000000),
(2, 2, 1, 'Canon EOS 2000Dباکیفیت', 3500000, 2, 7000000),
(3, 3, 1, 'Canon EOS 2000Dباکیفیت', 3500000, 4, 14000000),
(4, 3, 3, 'saba', 1200000, 3, 3600000),
(5, 4, 1, 'Canon EOS 2000Dباکیفیت', 3500000, 1, 3500000),
(6, 5, 18, 'دوربین فوجی فیلم GFX100S', 32000000, 2, 64000000);

-- --------------------------------------------------------

--
-- Table structure for table `photography_news`
--

CREATE TABLE `photography_news` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `blog_post_id` int(11) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `image` varchar(255) DEFAULT NULL,
  `link` varchar(255) DEFAULT '#',
  `sort_order` int(11) DEFAULT 0,
  `status` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `photography_news`
--

INSERT INTO `photography_news` (`id`, `title`, `blog_post_id`, `description`, `image`, `link`, `sort_order`, `status`) VALUES
(1, 'یک عنوان تستی', NULL, 'یک توضیح کوتاه', 'news_6a98bdfdec97e0.33068045.jpg', '#', 1, 1),
(2, 'یک عنوان تستی', NULL, 'یک توضیح کوتاه', 'news_6a98bfbaf35fa5.89260199.jpg', '#', 2, 1),
(3, 'یک عنوان تستی', NULL, 'یک توضیح کوتاه', 'news_6a98bf9a252936.86976978.jpg', '#', 3, 1);

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `price` int(11) NOT NULL,
  `old_price` int(11) DEFAULT NULL,
  `stock` int(11) NOT NULL DEFAULT 0,
  `image` varchar(255) NOT NULL,
  `category` varchar(100) NOT NULL,
  `discription` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `category_id` int(11) DEFAULT NULL,
  `brand_id` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`id`, `name`, `price`, `old_price`, `stock`, `image`, `category`, `discription`, `created_at`, `category_id`, `brand_id`) VALUES
(1, 'دوربین فوجی فیلم GFX100S', 32000000, 34999983, 0, 'product_6a96b8a9b4bf71.91821186.png', 'دوربین عکاسی', '', '2026-09-04 19:02:31', 13, 1),
(3, 'دوربین فوجی فیلم GFX100S', 32000000, 34999981, 2, 'product_6a96b9f7c6d299.90737929.png', 'دوربین عکاسی', '', '2026-09-05 16:13:32', 13, 1),
(6, 'دوربین فوجی فیلم GFX100S', 32000000, 34999925, 2, 'product_6a96ba08814e74.47789552.png', 'لنز دوربین عکاسی', '', '2026-09-05 16:13:47', 3, NULL),
(8, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 3, 'product_6a96ba6f1c9cb2.02026461.png', 'دوربین عکاسی', '', '2026-09-04 19:02:31', 13, 1),
(9, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 3, 'product_6a96ba8a971851.56465907.png', 'لنز دوربین عکاسی', '', '2026-09-01 13:03:01', 3, NULL),
(10, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 2, 'product_6a96baa35ae4d2.29229958.png', 'لنز دوربین عکاسی', '', '2026-09-01 13:03:11', 3, NULL),
(11, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 3, 'product_6a96bab5d25825.96431416.png', 'لنز دوربین عکاسی', '', '2026-09-01 13:03:33', 3, NULL),
(12, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 5, 'product_6a96bacf34cca2.17114762.png', 'لوازم جانبی', '', '2026-09-01 13:03:57', 6, NULL),
(13, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 2, 'product_6a96bae1454b93.54453272.png', 'لوازم جانبی', '', '2026-09-01 13:03:44', 6, NULL),
(14, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 2, 'product_6a96baf3db69e9.82535490.png', 'لوازم جانبی', '', '2026-09-01 13:04:28', 6, NULL),
(15, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 0, 'product_6a96bb0aeafcd7.39306468.png', 'لوازم جانبی', '', '2026-09-01 13:06:00', 6, NULL),
(16, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 3, 'product_6a96bbaf23f6a9.07065855.png', 'دوربین عکاسی', '', '2026-09-04 19:02:31', 13, 1),
(17, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 1, 'product_6a96bbfecc0815.92929355.png', 'دوربین عکاسی', '', '2026-09-04 19:02:31', 13, 1),
(18, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 0, 'product_6a96beda986766.39779858.png', 'دوربین عکاسی', '', '2026-09-06 03:05:00', 13, 1),
(19, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 2, 'product_6a96bf01a6cc05.27897376.png', 'دوربین عکاسی', '', '2026-09-05 23:10:47', 13, 1),
(20, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 2, 'product_6a96c1f40f6af4.93913619.png', 'لنز دوربین عکاسی', '', '2026-09-01 13:05:05', 3, NULL),
(21, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 5, 'product_6a96c212704084.01459630.png', 'لوازم جانبی', '', '2026-09-01 12:48:21', 6, NULL),
(22, 'دوربین فوجی فیلم GFX100S', 32000000, 35000000, 0, 'product_6a96cc9b10c686.64987712.png', 'دوربین عکاسی', '', '2026-09-04 19:02:31', 13, 1),
(23, 'Canon EOS 2000Dباکیفیت', 32000000, 6000000, 2, 'product_6a9b0f1c6f9438.26663426.png', 'دوربین عکاسی', '', '2026-09-04 19:02:31', 13, 4);

-- --------------------------------------------------------

--
-- Table structure for table `product_gallery`
--

CREATE TABLE `product_gallery` (
  `id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `category_id` int(11) DEFAULT NULL,
  `image` varchar(255) NOT NULL,
  `link` varchar(255) DEFAULT '#',
  `sort_order` int(11) DEFAULT 0,
  `status` tinyint(1) DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `product_gallery`
--

INSERT INTO `product_gallery` (`id`, `title`, `category_id`, `image`, `link`, `sort_order`, `status`) VALUES
(1, 'انواع لنز دوربین', NULL, '100.png', '#', 1, 1),
(2, 'انواع دوربین فیلم برداری', NULL, '101.png', '#', 2, 1),
(3, 'انواع دوربین عکاسی', NULL, '102.png', '#', 3, 1),
(4, 'لوازم جانبی', NULL, '103.png', '#', 4, 1),
(5, 'پایه دوربین', NULL, '104.png', '#', 5, 1),
(6, 'تجهیزات نورپردازی', NULL, '105.png', '#', 6, 1);

-- --------------------------------------------------------

--
-- Table structure for table `product_reviews`
--

CREATE TABLE `product_reviews` (
  `id` int(11) NOT NULL,
  `product_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `content` text NOT NULL,
  `image` varchar(255) DEFAULT NULL,
  `status` tinyint(1) NOT NULL DEFAULT 1,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `content_after_image` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `product_reviews`
--

INSERT INTO `product_reviews` (`id`, `product_id`, `title`, `content`, `image`, `status`, `created_at`, `updated_at`, `content_after_image`) VALUES
(3, 1, 'نقد و بررسی دوربین', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...', '1788678841_6a9d12b9a684f.png', 1, '2026-09-06 05:25:22', '2026-09-06 07:14:01', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...'),
(4, 3, 'بررسی تخصصی دوربین', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...', '1788678826_6a9d12aad3970.png', 1, '2026-09-06 05:26:19', '2026-09-06 07:13:46', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...'),
(5, 6, 'بررسی تخصصی دوربین', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...', '1788678813_6a9d129da3a2c.png', 1, '2026-09-06 05:26:46', '2026-09-06 07:13:33', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...'),
(6, 23, 'بررسی تخصصی دوربین', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...', '1788678789_6a9d12856fe0e.png', 1, '2026-09-06 05:27:23', '2026-09-06 07:13:09', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...'),
(7, 22, 'بررسی تخصصی دوربین', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...', '1788678857_6a9d12c9ee6c7.png', 1, '2026-09-06 05:27:49', '2026-09-06 07:14:17', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...'),
(8, 21, 'بررسی تخصصی دوربین', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...', '1788672503_6a9cf9f71ea63.png', 1, '2026-09-06 05:28:23', '2026-09-06 05:28:23', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...'),
(9, 20, 'بررسی تخصصی دوربین', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...', '1788672546_6a9cfa22ec155.png', 1, '2026-09-06 05:29:06', '2026-09-06 05:29:06', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...'),
(10, 19, 'بررسی تخصصی دوربین', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...', '1788672568_6a9cfa381c040.png', 1, '2026-09-06 05:29:28', '2026-09-06 05:29:28', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...'),
(11, 18, 'بررسی تخصصی دوربین', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...', '1788672588_6a9cfa4cb1b6b.png', 1, '2026-09-06 05:29:48', '2026-09-06 05:29:48', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...'),
(12, 17, 'بررسی تخصصی دوربین', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...', '1788672606_6a9cfa5e65497.png', 1, '2026-09-06 05:30:06', '2026-09-06 05:30:06', 'به پردازش K میباشد که میتوانید به استفاده از آن به فیلمبرداری بلک مجیک 12 که یکی از جدیدترین محصولات معرفی شده برند یورزا مینی پرو 12K، دوربین فیلمبرداری بلک مجیک را پشتیبانی میکند و قیمت بسیار بالایی نیز دارد. با نرخ 60 فریم بر ثانیهش کاربری ندارد. زیر نمایشگرهای موجود در حال حاضر تا 8K میتوان گفت در حال حاضر استفاده از 12 دارد. بلک مجیک این دوربین را بیشتر برای نشان دادن قدرت خود تولید کرده است و در حال حاضرش دوربینی در رده خود رقیبی محصول نمیباشد. البته گفتنی است که این را نیز با نرخهای بالاتری به ثبت برساند که کاربر اصلی به این محصول به شما میرود. K و 8K محصولی میتواند فیلمهای 4...');

-- --------------------------------------------------------

--
-- Table structure for table `site_settings`
--

CREATE TABLE `site_settings` (
  `id` int(11) NOT NULL,
  `site_name` varchar(255) DEFAULT NULL,
  `admin_email` varchar(255) DEFAULT NULL,
  `logo` varchar(255) DEFAULT NULL,
  `cart_link` varchar(255) DEFAULT NULL,
  `login_link` varchar(255) DEFAULT NULL,
  `cart_text` varchar(100) DEFAULT NULL,
  `cart_icon` varchar(255) DEFAULT NULL,
  `contact_text` varchar(100) DEFAULT NULL,
  `contact_icon` varchar(255) DEFAULT NULL,
  `contact_link` varchar(255) NOT NULL,
  `login_icon` varchar(255) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `site_settings`
--

INSERT INTO `site_settings` (`id`, `site_name`, `admin_email`, `logo`, `cart_link`, `login_link`, `cart_text`, `cart_icon`, `contact_text`, `contact_icon`, `contact_link`, `login_icon`) VALUES
(1, 'فروشگاه دوربین', NULL, 'logo.png', 'cart.php', 'login.php', 'سبد خرید', 'sbd.png', 'تماس با ما', 'tm.png', 'contact.php', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `email` varchar(150) NOT NULL,
  `password` varchar(255) NOT NULL,
  `role` varchar(20) NOT NULL,
  `created_at` datetime NOT NULL,
  `status` tinyint(4) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_persian_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `email`, `password`, `role`, `created_at`, `status`) VALUES
(1, 'Admin', 'admin@test.com', '$2y$10$2EwaWiWNu2IOQxXsAHm2KOFoRTJNxHhX3z5VLRwUyGdey2nDw2kZa', 'admin', '2026-08-19 20:11:06', 1),
(2, 'ilya', 'zareisara456@gmail.com', '$2y$10$uelE0rZHO5DnTIpoZ5u9eueMEFeumhrZzEzFszMyDNVFm/MWwrE.i', 'user', '0000-00-00 00:00:00', 1),
(3, 'ilya', 'ilya@gmail.com', '$2y$10$N.SJrr.5avB94zcjyklyiuz/f4.TLkkokr4Lnq5ibtUO..WOHoXDm', 'user', '0000-00-00 00:00:00', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `banners`
--
ALTER TABLE `banners`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `blog_comments`
--
ALTER TABLE `blog_comments`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `blog_posts`
--
ALTER TABLE `blog_posts`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_slug` (`slug`);

--
-- Indexes for table `blog_post_blocks`
--
ALTER TABLE `blog_post_blocks`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_post_id` (`post_id`),
  ADD KEY `idx_post_order` (`post_id`,`sort_order`);

--
-- Indexes for table `brands`
--
ALTER TABLE `brands`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `category_faq`
--
ALTER TABLE `category_faq`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contact_info`
--
ALTER TABLE `contact_info`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contact_messages`
--
ALTER TABLE `contact_messages`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `contact_page`
--
ALTER TABLE `contact_page`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `customer_comments`
--
ALTER TABLE `customer_comments`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `footer`
--
ALTER TABLE `footer`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `footer_emails`
--
ALTER TABLE `footer_emails`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `footer_items`
--
ALTER TABLE `footer_items`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `footer_socials`
--
ALTER TABLE `footer_socials`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `home_content`
--
ALTER TABLE `home_content`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `latest_product_boxes`
--
ALTER TABLE `latest_product_boxes`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `latest_product_box_items`
--
ALTER TABLE `latest_product_box_items`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `menus`
--
ALTER TABLE `menus`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `order_items`
--
ALTER TABLE `order_items`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `photography_news`
--
ALTER TABLE `photography_news`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `product_gallery`
--
ALTER TABLE `product_gallery`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `product_reviews`
--
ALTER TABLE `product_reviews`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_product_review` (`product_id`);

--
-- Indexes for table `site_settings`
--
ALTER TABLE `site_settings`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `banners`
--
ALTER TABLE `banners`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `blog_comments`
--
ALTER TABLE `blog_comments`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `blog_posts`
--
ALTER TABLE `blog_posts`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=18;

--
-- AUTO_INCREMENT for table `blog_post_blocks`
--
ALTER TABLE `blog_post_blocks`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=115;

--
-- AUTO_INCREMENT for table `brands`
--
ALTER TABLE `brands`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `category_faq`
--
ALTER TABLE `category_faq`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `contact_info`
--
ALTER TABLE `contact_info`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `contact_messages`
--
ALTER TABLE `contact_messages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `contact_page`
--
ALTER TABLE `contact_page`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `customer_comments`
--
ALTER TABLE `customer_comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `footer`
--
ALTER TABLE `footer`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `footer_emails`
--
ALTER TABLE `footer_emails`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `footer_items`
--
ALTER TABLE `footer_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `footer_socials`
--
ALTER TABLE `footer_socials`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `home_content`
--
ALTER TABLE `home_content`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `latest_product_boxes`
--
ALTER TABLE `latest_product_boxes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `latest_product_box_items`
--
ALTER TABLE `latest_product_box_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `menus`
--
ALTER TABLE `menus`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `order_items`
--
ALTER TABLE `order_items`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `photography_news`
--
ALTER TABLE `photography_news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;

--
-- AUTO_INCREMENT for table `product_gallery`
--
ALTER TABLE `product_gallery`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT for table `product_reviews`
--
ALTER TABLE `product_reviews`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `site_settings`
--
ALTER TABLE `site_settings`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
